#+TITLE: Org Mode Configuration
#+AUTHOR: Phillip O'Reggio
#+PROPERTY: header-args :emacs-lisp :tangle yes :comments link
#+STARTUP: hideblocks overview
#+BEGIN_SRC emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+END_SRC

** Floatbuf
Set floatbuf frame parameters
#+begin_src emacs-lisp
(after! floatbuf
  (push '(alpha . 100) floatbuf-frame-params)
  (push '(alpha-background . 0.65) floatbuf-frame-params)
  (if (not IS-MAC)
      (push '(parent-frame . nil) floatbuf-frame-params)))
#+end_src

#+RESULTS:
: ((parent-frame) (alpha-background . 0.65) (alpha . 100) (parent-frame) (alpha-background . 0.65) (alpha . 100) (vertical-scroll-bars) (tool-bar-lines . 0) (menu-bar-lines . 0) (buffer-predicate . doom-buffer-frame-predicate))

    Add key mappings for floating buffers
#+BEGIN_SRC emacs-lisp
(require 'floatbuf)

(after! floatbuf
  ;; with buffer
  (defun personal-floatbuf-with-buffer ()
    "Create floating buffer with the current buffer."
    (interactive)
    (floatbuf-make-floatbuf))
  ;; with terminal
  (defun personal-floatbuf-with-terminal ()
    "Create floating buffer with the a terminal."
    (interactive)
    (floatbuf-make-floatbuf)
    (+vterm/here nil))
  ;; scratch buffer
  (defun personal-floatbuf-with-scratch ()
    "Create floating buffer with the a scratch buffer"
    (interactive)
    (floatbuf-make-floatbuf-with-buffer (get-buffer "*scratch*")))
  ;; Epaint
  (defun personal-floatbuf-with-epaint ()
    "Create floating buffer with an epaint buffer"
    (interactive)
    (floatbuf-make-floatbuf)
    (epaint))
  ;; web browser
  (defun personal-floatbuf-with-xwidget ()
    "Create floating buffer with the xwidget"
    (interactive)
    (floatbuf-make-floatbuf)
    (personal-google-here))
  ;; mapping
  (map! :leader :mode 'global
        "fbS" #'personal-floatbuf-with-xwidget
        "fbe" #'personal-floatbuf-with-epaint
        "fbf" #'floatbuf-make-floatbuf
        "fbs" #'personal-floatbuf-with-scratch
        "fbt" #'personal-floatbuf-with-terminal))
#+END_SRC

** Fun Stuff
 Fun Emacs things

 Zone mode screen saver after a good amount of idle time
 #+BEGIN_SRC emacs-lisp
 (require 'zone)
 (zone-when-idle 600) ;; 10 minutes
 #+END_SRC

Disable all non productive stuff (for lectures or presentations)
#+BEGIN_SRC emacs-lisp
(defun personal-look-professional ()
  "Disable all idle animations and related."
  (interactive)
  (huecycle-stop-idle)
  (huecycle-reset-all-faces-on-all-buffers)
  (zone-leave-me-alone))
#+END_SRC

Add rainbow to zone programs
#+BEGIN_SRC elisp
(setq zone-programs (vconcat [zone-rainbow] zone-programs))
#+END_SRC

Enable sound support
#+BEGIN_SRC elisp
(unless (and (fboundp 'play-sound-internal)
             (subrp (symbol-function 'play-sound-internal)))
  (require 'play-sound))
#+END_SRC

Set some faces to change color when idle
#+BEGIN_SRC elisp
(require 'huecycle)

(setq personal--hl-line-bg-light-arg (ewal-load-color 'white -19.5))
(setq personal--hl-line-bg-dark-arg (ewal-load-color 'black -17.5))

;; Less packages, to do huecycle at startup
(after! (huecycle doom-modeline hl-line ewal)
  (huecycle-set-faces
   ;; rainbow stuff
   ((foreground . (doom-modeline-evil-normal-state
                   doom-modeline-evil-insert-state
                   doom-modeline-buffer-major-mode
                   line-number-current-line
                   doom-modeline-panel
                   doom-modeline-info
                   ))
    :random-color-hue-range (0.0 1.0)
    :random-color-saturation-range (0.8 1.0)
    :random-color-luminance-range (0.5 0.8)
    :speed 0.5)

   ;; highlight rainbow
   ((foreground . region)
    :random-color-hue-range (0.0 1.0)
    :random-color-saturation-range (0.9 1.0)
    :random-color-luminance-range (0.5 0.8))

   ;; Non Rainbow stuff
   ((background . hl-line)
    :color-list (personal--hl-line-bg-light-arg personal--hl-line-bg-dark-arg personal--hl-line-bg-dark-arg)
    :next-color-func huecycle-get-next-list-color
    :speed 1.5
    :persist t))
  (huecycle-when-idle 1.0))

;;  (setq huecycle-buffers-to-huecycle-in
;;        (list
;;         #'current-buffer
;;         (lambda ()
;;           (company-box--get-buffer))))
;;  (huecycle-when-idle 1.0))

;; More packages, all faces to huecycle with
(after! (huecycle doom-modeline hl-line ewal lsp-mode)
  (huecycle-set-faces
   ;; rainbow stuff
   ((foreground . (doom-modeline-evil-normal-state
                   doom-modeline-evil-insert-state
                   doom-modeline-buffer-major-mode
                   line-number-current-line
                   doom-modeline-lsp-success
                   doom-modeline-panel
                   doom-modeline-info
                   lsp-face-highlight-write
                   lsp-face-highlight-read
                   ))
    :random-color-hue-range (0.0 1.0)
    :random-color-saturation-range (0.8 1.0)
    :random-color-luminance-range (0.5 0.8)
    :speed 0.5)

   ;; highlight rainbow
   ((foreground . region)
    :random-color-hue-range (0.0 1.0)
    :random-color-saturation-range (0.9 1.0)
    :random-color-luminance-range (0.5 0.8))

   ;; Non Rainbow stuff; hl-line glow
   ((background . hl-line)
    :color-list (personal--hl-line-bg-light-arg personal--hl-line-bg-dark-arg personal--hl-line-bg-dark-arg)
    :next-color-func huecycle-get-next-list-color
    :speed 1.5
    :persist t)))

  ;; Add the demap minimap
  ;; (setq huecycle-buffers-to-huecycle-in
  ;;       (list
  ;;        #'current-buffer
  ;;        (lambda ()
  ;;          (company-box--get-buffer)))))

#+END_SRC

#+RESULTS:
| #s(huecycle--interp-datum ((foreground doom-modeline-evil-normal-state doom-modeline-evil-insert-state doom-modeline-buffer-major-mode line-number-current-line doom-modeline-lsp-success doom-modeline-panel doom-modeline-info lsp-face-highlight-write lsp-face-highlight-read)) nil nil nil 0.0 huecycle-interpolate-linear huecycle-get-random-hsl-color nil (0.0 1.0) (0.8 1.0) (0.5 0.8) 0 nil 0.5 nil) | #s(huecycle--interp-datum ((foreground region)) nil nil nil 0.0 huecycle-interpolate-linear huecycle-get-random-hsl-color nil (0.0 1.0) (0.9 1.0) (0.5 0.8) 0 nil 1.0 nil) | #s(huecycle--interp-datum ((background hl-line)) nil nil nil 0.0 huecycle-interpolate-linear huecycle-get-next-list-color (#s(huecycle--color 0.08333333333333363 0.024390243902439025 0.16078431372549018) #s(huecycle--color 0.07407407407407411 0.045685279187817236 0.3862745098039216) #s(huecycle--color 0.07407407407407411 0.045685279187817236 0.3862745098039216)) (0.0 1.0) (0.5 1.0) (0.2 0.3) 0 nil 1.5 t) |

